//#include <iostream>

// 1. 변수 선언
// num이라는 변수에 10을 저장하자.

//int num;   // 변수 선언 : 변수 선언을 통해 변수를 사용할 공간을 램에게서 할당받는다.
//num = 10;  // 변수에 값을 대입


/*2. 함수 선언(함수 정의)
함수의 정의 : 출력 함수명(입력){} 로 구성
               머리 3행, 몸체 4~6행
               main 함수의 경우 입력이 없다.
               {}를 통해 함수의 범위를 알려준다.            



int func(void){    : 함수의 이름은 func이고 
                   : 입력은 없고 출력도 없다.
}

void func1(int a){ : 함수 이름은 func1이고
                   : 입력은 int a 이고 출력은 없다.
}

int func2(){        : 함수 이름은 func2이고
                    : 입력은 없고, 출력은 int이다.

return int(정수)    : 출력이 있으면 반드시 호출한 곳에 return을 해줘야 한다.
}

3. 함수 호출
형태 : 함수 머리에서 출력을 생략한 형태.

func();   
func1();   
func2();   

*/



